library(tidytext)
library(magrittr)
library(dplyr)
library(ggplot2)
library(janeaustenr)
library(tidyr)
library(igraph)
library(ggraph)
library(topicmodels)
library(tm)

# Loading Dudu Faruk's songs:
text <- c("יושב על הטיל וטס לה בתחת נדלק לי הפתיל כולי בא בצהריים אל הבת של השכן אני מבקש חלב והיא עונה לי דודו כן כן גדלתי על מבט כואב כפרה לא על בן תן אני עושה סיבובים על הכלי ומבריק אותו טוב כמו אבן חן מברך על הגוף שלה והיא עונה אמן ערק ערק ערק כמה בא לי ערק אני מתלבש ארמני ואתה בזארה רק אני בא כמו צונאמי ואתה בחוואה אני בא כמו גולני ואתה חיזבאללה כמה קראק עליי שזה מדהים כמו פלאפל דודו בא בארבע טעמים כשאתה מבקש חלב אתה נראה מגעיל כשאני מבקש חלב אני נראה מדהים בא לי ערק ערק של האייפון איקס אתה ילד חרא הבאתי מגבונים ערק ערק ערק כמה בא לי ערק אני מתלבש ארמני ואתה בזארה רק ערק ערק ערק ערק מים ערק אמרתי זה ערק ותראה בולעת ערק ערק ערק כמה בא לי ערק אני מתלבש ארמני ואתה בזארה רק אני כמו דוד המלך ואתה מובראק ערק ערק ערק ערק יא בת זונה",
          "מאמי אני חם עלייך תקראי לי טסטוסטראובן אני גנוב עליה גנבה לי את הלב דדדאבו משחק ומזיז בחורות כמו דמקה יושבות עליי שתיים בוכות למה מה קרה מה קרה מה קרה מה קרה מה קרה מה קרה הלך לך המסקרה אני מסובב אותך בחנוכה זה כתוב בתורה שתי בחורות מינימום זה כתוב בגמרא נותן לה סילסול היא גמרה שתי בחורות עם אותו לבוש אאוטפיט לדודו יש ביקוש קלאסי מרגיש בטורקיה כי הביט לובש תרבוש בסים ראתה תנייק אמרה לי אתה מושלם לי אני גנוב עליה משחק הכדורגל בין ביתר ירושלים להפועל תל אביב גלש שוב מהגבולות הספורטיביים גם ביציעים נשמע שיר חדש של אוהדי ביתר משכה לה את החוטיני ולא עזבה משכתי לה חזק כאילו בקולר משכה לה את החוטיני ולא עזבה אמרתי לה עזבי זה לא קולר שתי בחורות עלי רק רבות בחדשות רק קרבות לא מזיז לי יש עלי מאות של בנות זה מגן מטילים וגם ממרגמות יא זונות ווש אני זוכר שפגשתי את אמא שלך היא אמרה לי אני אישתך היא אמרה לי אני רק צריכה שתתן לי תמיכה אז לקחתי אותה ועוד בחורה שאלה למה מה אמרתי זה חובה גם אם לא אהבה היא נתנה אהבה ונכנסתי לה עד לקיבה תודה שלא עשיתני אישה תודה שאני דוד ואני עצבני תמיד התחפשה לבאקסבאני ואני אדידס שרשרת צמיד ימנייק משכה לה את החוטיני ולא עזבה משכתי לה חזק כאילו בקולר משכה לה את החוטיני ולא עזבה אמרתי לה עזבי זה לא קולר שתי בחורות עלי ווי שתי בחורות עלי ווף שלפתי תפרח שלי והן ליקקו את הצוף אני בחור מיוחד לא אוהב אף אחד אין לי מדליית ארד רק אחת והיא ספיישל אדישן ומי שעונד מקבל סופרוויזן אמרה לי תיקח אותי דודו יא פישר אמרתי לה רק אם תעשי אודישן איי הו אמרתי לה שלא תיגע בי עוד לא סובבתי את התמונה של הרבי אני דודו פארוק מאמי משכה לה את החוטיני ולא עזבה משכתי לה חזק כאילו בקולר משכה לה את החוטיני ולא עזבה אמרתי לה עזבי זה לא קולר",
          "הלו יס היז ניים איז אלירן סבג שוחט תודה !אה! לא לא אלירן סבג יס יס הי איז וורי וויולנט יו סאונד פריטי יו נואו אלירן סבג למה ככה חזק למה ככה איך זה שאתה ככה חזק מה כמוני תגיד מאיפה באת לנו מכוכב חלל אלירן !אלירן אתה מסוכן פה לקהל אלירן! אלירן  הוא קם בבוקר לא זוכר מה היה אתמול לא זוכר שום דבר כל הבית כדורים לא של כדורסל לא של אקמול החברה שלו נעלמה לפני שבוע היה לפני שבועיים לדעתי חיפושים עניינים הוא אפילו לא טרח לשאול למה מדוע כשמבקשים ממנו לעשות טובה מקבל חשמל מבקש אותה בחזרה יש לו ורידים במצח כמו שני נחשים אומר הוא אלרגי לדברי תורה לא הגיוני בוא אלירן בוא תלך לישון תנוח דודו יודע מה זה קריזה דודו לא ישן שבוע בוא כפרה תשכב על הפלטה תנוח אלירן סבג למה ככה חזק למה ככה איך זה שאתה ככה חזק מה כמוני תגיד מאיפה באת לנו מכוכב חלל אלירן אלירן אתה מסוכן לי לקהל אלירן! אלירן! אתה מזכיר לי טיפה את עצמי עצבני פסיכופת לא רגוע אבל אני כולי קלאס קראטה ארמני ואתה סרחנה יש לי בס בבגאז׳ שעונים כולך אתה על אוטו טרנטה אל תיגע בו נגעת נסעת אלירן שברת שילמת! מגעיל ברגיל כל הזמן צבוע לכל השבוע צבעוני הבחור הזה לא רגוע ADHD חרמן באחול של בלוע איכס אומרים לי זה אלירן גועל נפש אמרתי מכחיש ריח של כבש אם חייכת אליו תפתח ספר תקרא קדיש אל תשכח שים כיפה אני מפרק כדורים פסיכיאטריים רק בשביל שיירגע המשוגע הזה שם לו בכוס הוא שותה והוזה תיתן לו מכות אלירן יהנה כל הגב צלקות שואל אותו ממה זה והוא לא עונה אל תתנו אהבה אל תתנו שום דבר אל תתנו אהבה הוא שונא אלירן! אתם לא יודעים כמה הוא שונא יש איזה אחת באה לו תן בוסה עד היום לא יודעים מה יש לה נשמעת לי מסכנה בכיתי עליה בכיתי על שטר של הלאה בכיתי על שטר של המאה זכיתי בשטר של הלוטו אלירן אתה אלירן אתה נרקומן אתה כולך איכס אתה כולך פיכס אתה כולך טרנינג שבע שמיניות אתה עם פרווה של חתולות עליו שרשרת של מגן דוד הפוך נראית בדיוק אותו דבר יא דבע אלירן סבג למה ככה חזק למה ככה איך זה שאתה ככה חזק מה כמוני תגיד מאיפה באת לנו מכוכב חלל אלירן אלירן אתה מסוכן לי לקהל אלירן! אלירן! אתה מזכיר לי טיפה את עצמי עצבני פסיכופת לא רגוע אבל אני כולי קלאס קראטה ארמני ואתה סרחנה יש לי בס בבגאז׳ שעונים כולך אתה על אוטו טרנטה אל תיגע בו נגעת נסעת אלירן שברת שילמת!",
          "דדדאבו כוסראבראבראבק דודו מתחיל בלאגן דודו דרוך מסוכן דודו בחור מסוגנן לדודו יש זין שני מטר לא בכיתי על גלעד שליט דודו לא בוכה בסתר דודו לא בוכה בסנטר לא לא לא לא לא בכיתי על גלעד שליט לא בכיתי לא לא בכיתי על גלעד שליט הזמינו אותי לאחד נגד מאה מסתבר זה טריוויה וכולי נוגח מוריד אותם אחד אחד אחד את המפיק את העורך את הצלם את המשתתפים כולם יעני הבמאי אמר לי דודו זה משחק חשיבה צריך לעבוד עם הראש לא בידיים נתתי לו ראסיה לתוך השיניים אמרתי לכם אני למדתי בשכונה אני בחור רשע כן די נותן בוקסים עשה לה תביא לה תקפיץ לה תבירה אמרתי לה בואי אחת לא כדאי מביא אותה מביא גם את אחותה אחותה מביא גם את אחותה וואו מביא גם את אחותה וואי לילה טוב אחותך לילה טוב התקשרה בתחנה מתי התקשרה בתחנה מתי זה קרה התקשרה בתחנה לילה טוב ביצ שלך שלחה נודס לקבה דרך הכותל ביצ שלך אוספת טייק אאוט מאבדת אוכל טמבלית הפסדת תבית כי אתה אפס בפוקר כולך גם מלחיץ וגם אתה נראה כמו סטוקר מוציא את השוקר מתפעל תאירוע אני ודודו פה עושים לך שימוע הורדת תגשר ויש לך קיבוע נפלת בגשם וכולך פצוע רוצה לקום בא עם כיפה של פתאל בא אני בלונה גל כולי ענק על גלגל רוקד פה לטיפות הטל מביא אותה אותה מביא גם את אחותה וואו מביא גם את אחותה וואו מביא גם את אחותה מי  לילה טוב לילה טוב אחותך מתי התקשרה בתחנה מתי זה קרה התקשרה בתחנה לילה טוב התקשרה בתחנה ביי",
          "אני דיברתי איתה שלא תעשה לי עכשיו בלאגנים מה מה מה זוהר זוהר חגורה שחורה בלעשן נרגילה את החגורות שלי קונה בטירה חגורה אבזם בגודל של החגורה שלי שווה אלפיים שלך אגורה אני מזיין ויש לי חוש שישי שבת מבקר בבית הכנסת בשישי שבת חגורה שלי נראית כמו מקרוקודיל אני מצליף איתה וכולך צלקות בגב כולך צלקות בגב כולך צלקות בגב הב הב הב כולך צלקות בגב כולך צלקות בגב אני נובח אתה גונח אני נושך אתה בורח לוקח לאשתך את הלב הסובארו שלי קופצת בהילוך איטי החגורה עור נחש אמיתי אני דודו פארוק לא משחקים איתי לא רוצה שתהיי אשתי חגורה שחורה בלעשן נרגילה את החגורות שלי קונה בטירה חגורה אבזם בגודל של החגורה שלי שווה אלפיים שלך אגורה כוסאמאמק ערס",
          "אם כן אנחנו נמצאים כאן בסמטאות החשוכות של תל אביביפו עם הזמר הידוע לשמצה דודו פארוק דודו ספר לנו כל המדינה שואלת למה כל השירים שלך הם על ארמני אין לך משהו אחר לשיר עליו ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני אמרתי אני כולי מזומן אני אני אני כולי מזומן אני אמרתי אני כולי מזומן אני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני למה הוא שר על ארמני למה כמה הוא שר על גיוונשי כמה כולי לובש גלבני איווה כולי תותח אני לא בחוואה אני פותח תאוזן שם לה תיד על המותן אני חם אני טוסטר אובן אני עבריין אני מותק ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני אמרתי אני כולי מזומן אני אני אני כולי מזומן אני אמרתי אני כולי מזומן אני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני עושה שכיבות סמיכה מתחת לשמיכה כולי נוטף זיעה לילה טוב נרדם על אשתך מתעצבן מכל דבר קטן עף כמו סופרמן אני פסיכופט מסוכן מסוגנן מטפס כמו באטמן ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני אמרתי אני כולי מזומן אני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני אמרתי אני כולי מזומן אני אני אני כולי מזומן אני אמרתי אני כולי מזומן אני גיוונשי גלבני ארמני ארמני ארמני ארמני ארמני ארמני ארמני ארמני גיוונשי גלבני",
          "בא לה מלמעלה באתי מלמטה היא רוקדת עושה מה שבא לה איווה בא לה מלמעלה באתי מלמטה שימי לב כן אני ילד חרא איווסקה אם הולכים למסעדה אז את משלמת ואם הגוף שלך רוטט אז אני בעניין נכון שאני מתנהג כמו מפלצת וגם אם השופוני עולה היא יורדת אני מחזיק תמיקרופון כמו בקבוק של ערק מתאים לי בול ליד נראה כמו צמיד פנדורה עולה על הבמה מרגיש אני נולדתי שמה גדלתי על שלום לך סיגל אתה על דורה אני מרגיש גנב מתגנב לי מאחורה יש לי כוחות מיוחדים קיבלתי מלמעלה רוקדת עושה מה שבא לה איווה בא לה מלמעלה אז באתי מלמטה מה שלומך את לא שואלת מה שלומי שבת אני ממלא קיסריה כמו שלומי שבן יש לי ארבעים קילו בין הרגליים אחרי זה קוראים לי המשפד אני משפד לך שתיים אני מתגנב עלייך ואת לא מרגישה איך את לא מרגישה אחלה גישה יש לי את משלמת ואת האישה אני לא משלם ושומר על גישה איך את לא מרגישה איך את לא מרגישה טיפשה אמרתי: גועל נפש ממש סתומה בא לה מלמעלה באתי מלמטה היא רוקדת עושה מה שבא לה איווה בא לה מלמעלה באתי מלמטה שימי לב כן אני ילד חרא איווסקה אתה מחזיק תמיקרופון נראה כמו ויברטור מזיע בידיים והמיקרופון מחליקך אחר כך משפשף אתה לא צריך תוזלינה אין לך שום חרוזים דפקת וואחד גלבה אני מתוקתק מתקתק אותך כמו שעון אני לא מחייך אף פעם אני לא בדיכאון אני את מדמיינת אותי במיטה שלך עם שמן קוקוס על הבטן ואני בכלל במיאמי נו דודו מה אחי זה יצא דוחה מה יש לך מה מה עובר עלייך תעשה תעשה לי שוב את הביט תעלה לי אותו חזרה אתה חצי חצי של אישה אני כלב תקיפה מצב רוח תקיפה אני אתה חיידק אני מגפה אני הוריקן ואתה מניפה של בחורה יפה אתה מתפשט כמו חשפן אני מתפשט כמו שריפה ואני מתלבש עלייך כאפה בא לה מלמעלה באתי מלמטה היא רוקדת עושה מה שבא לה איווה בא לה מלמעלה באתי מלמטה שימי לב כן אני ילד חרא איווה בא לה מלמעלה באתי מלמטה היא רוקדת עושה מה שבא לה איווה בא לה מלמעלה באתי מלמטה שימי לב כן אני ילד חרא מניאק",
          "קיקי דו יו לאב מי כמו נפץ אני עלי גיוונשי וולק קיקי בלי שיניים זה לא ליקריץ קולמארי לא בפיתה שלי בספארי כמו קוף אני מתפס למעלה מגרד בביצים עישנת ג׳וקים חזי זה בשבילך פופים פופים כמו עוזי אתה יורה מילים אל תזוזי מפונק אני עצוב לי בג׳קוזי אתה מאמי כמו כלב שים עליך רצועה שלא תנבח לי שלא תנבח לי שים עליך רצועה כי אתה כלב שלא תנבח לנו חח אל תנבח לנו קיקי דו יו לאב מי כמו נפץ אני עלי גיוונשי וולק קיקי דו יו לאב מי מאמי דו יו וואנט מי אקרובט אני השופוני זה עלי טבעי פפרצי עלי כמו אם טי וי אני טורבו במיטה מפעיל לה נייטרו עושה לה תרגילים אני טורפדווו כמו נייטרו על הטורפדו קיקי דו יו לאב מי כמו נפץ אני עלי גיוונשי וולק קיקי דו יו לאב מי מאמי דו יו וואנט מי אקרובט אני לא שאלתי מה זה מזראטי ולמה למבורגיני ולמה כל החוטיני נופל לה קיקי דו יו לאב מי כמו נפץ אני עלי גיוונשי וולק קיקי דו יו לאב מי מאמי דו יו וואנט מי אקרובט אני",
          "שוחט תודה אמרתי לה שאני אעשה לה היא אמרה לי מה תעשה לי אמרתי אעשה לה אמרה לי מה תעשה לי אמרתי אעשה לה אמרה לי מה תעשה לי אמרתי אעשה לה עשה לה עשה לה תביא לה תקפיץ את הטקילה אני נדיב מחלק את הכאפות מקפיץ את הלאפות מורח את החומוס מבריק את הטאסות מקצץ את הבאסות את הבצות אמרתי באסות איזה באסה לא נורא לא נורא מעצב לך אותן יפה יפה בצורת מגן דוד וכשיש בצורת יש לי קילו בצל תמיד שומר על החשיש מכל איש פן ייפגע אני לא צריך קרב מגע אני לא צריך עבודה עבדתי בתחנה בואי לפה חמודה לא צריכה מסעדה את צריכה אבא אמיתי אחד שיגיד לך תלמדי אחד שיגיד לך תרקדי בחור רזה אלסידי בחור רזה אלאסדי אוכל את הבת של זונה נותן לאוויר ירייה תראה איך העיר נרגעה תראה איך ההיא נרגעה תשמע איזה שקט שקיעה תשמע איזה שקע שקיעה לילה טוב עיירה לילה טוב נשמה כולם על הזין כולם על הזין כולם על הזין שלי עדיין בוכה בגללי עדיין שוחה בימית 2000 נותנת עבודה עם השמן זית ואני מוריד מכנסיים עדיין בוכה בגללי עדיין שוחה בימית 2000 נותנת עבודה עם השמן זית ואני מוריד מכנסיים שולף את הביצים לוקי דלוקי ודודו מתמרן אותם כמו בובת וודו מושך לה בחוטים כמו מריונטה בוחר את הביצ שלי בפינצטה מביא אותה כמו שחקן כדור נוצה אוסף את הביצס שלי עם מריצה יוצאת עם לוקי אז את אמיצה בחורה שלי תמיד מרוצה לחברות מביאה המלצה היי ביצס טובות בהפצה ושיווק באה מוכנה לתדלוק עם בקבוק הנסי על הגט טקסי הנהג שלה רוסי מונית עם שטיח פרסי תחביב שלו לחתוך עם מצטה מהמר כבד על רולטה בא לה איתי קטע מתחילה משטר דיאטה מוציא לה שטר של מאה מוציא לה שטר של לאה מזיין אותה מרים תה ללייאפ יש לי ביצס באייפון באקאפ אין לי ספות מאיקאה על הזין שלי מה שתה יודע כולם על הזין כולם על הזין כולם על הזין שלי עדיין בוכה בגללי עדיין שוחה בימית 2000 נותנת עבודה עם השמן זית ואני מוריד מכנסיים עדיין בוכה בגללי עדיין שוחה בימית 2000 נותנת עבודה עם השמן זית ואני מוריד מכנסיים שולף את הביצים כולם על הזין כולם על הזין כולם על הזין שלי")

# Creating stop words list:
stop_words <- c("אני",
                "לא",
                "לה",
                "על",
                "מה",
                "כמו",
                "זה",
                "של",
                "בא",
                "עם",
                "שלי",
                "יש",
                "לך",
                "מי",
                "היא",
                "עלי",
                "אל",
                "גם",
                "את",
                "לי",
                "אתה",
                "יו",
                "למה",
                "דו",
                "כולם",
                "ואתה",
                "ככה",
                "רק",
                "איך",
                "הוא",
                "ואני",
                "כן",
                "שלך",
                "אם",
                "כמה",
                "ולא",
                "כל",
                "שלו",
                "אז",
                "לו",
                "אין",
                "יא"
)


text_df <- tibble(line = 1:9, text = text)

# Turning words in songs (documents) into tokens:
tidy_dudu <- text_df %>%
  unnest_tokens(word, text)

# Deleting stop words:
stop_words <- as.data.frame(cbind(stop_words, c("SMART")))
colnames(stop_words) <- c("word", "lexicone")
tidy_dudu <- tidy_dudu %>%
  anti_join(stop_words)

# Counting words:
tidy_dudu_count <- tidy_dudu %>%
  count(word)

# Word count bar graph:
tidy_dudu_count %>%
  filter(n > 9) %>%
  mutate(word = reorder(word, n)) %>%
  ggplot(aes(word, n)) +
  geom_col() +
  xlab(NULL) +
  coord_flip()

# Creating bigrams:
dudu_bigrams <- text_df %>%
  unnest_tokens(bigram, text, token = "ngrams", n = 3)

# Top bigrams:
dudu_bigrams_sorted <- dudu_bigrams %>%
  count(bigram, sort = TRUE)

bigrams_separated <- dudu_bigrams %>%
  separate(bigram, c("word1", "word2"), sep = " ")

bigrams_filtered <- bigrams_separated %>%
  filter(!word1 %in% stop_words$word) %>%
  filter(!word2 %in% stop_words$word)

# new bigram counts:
bigram_counts <- bigrams_filtered %>% 
  count(word1, word2, sort = TRUE)


# Creating bigram graph:
bigram_graph <- bigram_counts %>%
  filter(n > 4) %>%
  graph_from_data_frame()

set.seed(2016)

a <- grid::arrow(type = "closed", length = unit(.15, "inches"))

ggraph(bigram_graph, layout = "fr") +
  geom_edge_link(aes(edge_alpha = n), show.legend = FALSE,
                 arrow = a, end_cap = circle(.07, 'inches')) +
  geom_node_point(color = "lightblue", size = 3) +
  geom_node_text(aes(label = name), vjust = 1, hjust = 1) +
  theme_void()

# Converting tokeneized words into doctype for LDA:
tidy_dudu_lda <- tidy_dudu %>% count(word, line)
tidy_dudu_lda <- tidy_dudu_lda[c(2, 1, 3)]
colnames(tidy_dudu_lda) <- c("document", "term", "count")
doctype <- tidy_dudu_lda %>%
  cast_dtm(document, term, count)

# LDA analysis and topic detection (k=2):
ap_lda <- LDA(doctype, k = 2, control = list(seed = 1234))
ap_topics <- tidy(ap_lda, matrix = "beta")
ap_top_terms <- ap_topics %>%
  group_by(topic) %>%
  top_n(10, beta) %>%
  ungroup() %>%
  arrange(topic, -beta)

# Topics graph:
ap_top_terms %>%
  mutate(term = reorder(term, beta)) %>%
  ggplot(aes(term, beta, fill = factor(topic))) +
  geom_col(show.legend = FALSE) +
  facet_wrap(~ topic, scales = "free") +
  coord_flip()

